app/controllers/books_controller.rb

 	def checkout
 		@book = Book.find(params[:book_id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", nil]]