app/controllers/public_library_controller.rb

    def index
        @library = PublicLibrary.new
        @library.save

        library2 = PublicLibrary.find(1)
        library2.name = "Brooklyn Center"
        library2.address = "Grand Army Plaza"
        library2.save
---
INSERT INTO "public_libraries" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-04-13 17:13:07.797446"], ["updated_at", "2016-04-13 17:13:07.797446"]]
SELECT  "public_libraries".* FROM "public_libraries" WHERE "public_libraries"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "public_libraries" SET "name" = ?, "address" = ?, "updated_at" = ? WHERE "public_libraries"."id" = ?  [["name", "Brooklyn Center"], ["address", "Grand Army Plaza"], ["updated_at", "2016-04-13 17:13:20.521935"], ["id", 1]]