app/views/public_library/index.html.erb

<% PublicLibrary.all.each do |publicLibrary| %>
---
SELECT "public_libraries".* FROM "public_libraries"